package com.ssafy.oh_jjeom_oh.domain.auth.service;

import org.springframework.stereotype.Service;

import java.util.Random;

@Service
public class NicknameService {
    private final String[] adjs = {"행복한", "즐거운", "빛나는", "똑똑한", "포근한", "상큼한", "든든한", "빠릿한", "침착한", "용감한",
            "신비한", "따스한", "깔끔한", "활발한", "다정한", "영리한", "강력한", "유연한", "특별한", "순수한",
            "멋드러진", "듬직한", "명랑한", "차분한", "기발한", "단단한", "화사한", "평온한", "예리한", "원대한",
            "듬직한", "신속한", "정직한", "신중한", "날렵한", "포근한", "근면한", "쾌활한", "온화한", "섬세한",
            "친근한", "영리한", "우아한", "상냥한", "민첩한", "풍성한", "포근한", "웅장한", "산뜻한", "완벽한",
            "성실한", "영특한", "포근한", "진지한", "고귀한", "우직한", "담백한", "순박한", "당당한", "듬직한",
            "명민한", "수줍은", "정겨운", "화창한", "은은한", "비범한", "근사한", "듬직한", "정갈한", "늠름한",
            "매끈한", "담대한", "강직한", "온화한", "준수한", "원만한", "해맑은", "풋풋한", "수려한", "아늑한",
            "신선한", "민감한", "엄격한", "유쾌한", "포용력", "침착한", "정확한", "치밀한", "열정적", "논리적",
            "합리적", "원칙적", "창의적", "감각적", "역동적", "안정적", "효율적", "주도적", "핵심적", "독보적"}; // 넉넉히 추가
    private final String[] nouns = {"다람쥐", "토끼", "강아지", "고양이", "펭귄", "쿼카", "여우", "사자", "호랑이", "치타",
            "수달", "해달", "곰", "팬더", "코알라", "노루", "사슴", "고래", "돌고래", "거북이",
            "참새", "까치", "부엉이", "올빼미", "독수리", "하마", "기린", "코끼리", "물개", "펭귄",
            "두루미", "병아리", "너구리", "두더지", "비버", "쿼카", "알파카", "라마", "염소", "양",
            "송아지", "망아지", "망둥어", "거북", "문어", "고래", "상어", "범고래", "토끼", "꿀벌",
            "매머드", "나무보", "미어캣", "고슴도", "도마뱀", "딱따구", "앵무새", "개구리", "올챙이", "두루미",
            "조개", "소라", "불가사", "해파리", "물고기", "연어", "참치", "메기", "미꾸라", "장어",
            "나비", "잠자리", "무당벌", "사마귀", "귀뚜라", "반딧불", "소", "말", "돼지", "쥐",
            "고라니", "맷돼지", "순록", "낙타", "코뿔소", "표범", "늑대", "코요테", "하이에", "바다표",
            "바다사", "바다코", "듀공", "매너티", "오리", "거위", "백조", "타조", "독수리", "콘도르"}; // 넉넉히 추가
    private final Random random = new Random();

    public String generateRandomNickname() {
        String adj = adjs[random.nextInt(adjs.length)];
        String noun = nouns[random.nextInt(nouns.length)];

        return adj + noun;
    }
}