package com.ssafy.oh_jjeom_oh.domain.auth.service;

import org.springframework.stereotype.Service;

import java.util.Random;

@Service
public class NicknameService {
    private final String[] adjs = {
            "행복한", "즐거운", "빛나는", "똑똑한", "포근한", "상큼한", "든든한", "빠릿한", "침착한", "용감한",
            "신비한", "따스한", "깔끔한", "활발한", "다정한", "영리한", "강력한", "유연한", "특별한", "순수한",
            "멋드러진", "명랑한", "차분한", "기발한", "단단한", "화사한", "평온한", "예리한", "원대한", "신속한",
            "정직한", "신중한", "날렵한", "근면한", "쾌활한", "온화한", "섬세한", "친근한", "우아한", "상냥한",
            "민첩한", "풍성한", "웅장한", "산뜻한", "완벽한", "성실한", "영특한", "진지한", "고귀한", "우직한",
            "담백한", "순박한", "당당한", "명민한", "수줍은", "정겨운", "화창한", "은은한", "비범한", "근사한",
            "듬직한", "정갈한", "늠름한", "매끈한", "담대한", "강직한", "준수한", "원만한", "해맑은", "풋풋한",
            "수려한", "아늑한", "신선한", "민감한", "엄격한", "유쾌한", "포용력", "정확한", "치밀한", "열정적",
            "논리적", "합리적", "원칙적", "창의적", "감각적", "역동적", "안정적", "효율적", "주도적", "핵심적",
            "독보적", "달콤한", "시원한", "가뿐한", "파릇한", "앙증맞은", "향긋한", "정다운", "웅대한", "고결한",
            "수수한", "영롱한", "찬란한", "고요한", "소중한", "강렬한", "씩씩한", "매혹적", "경쾌한", "선명한",
            "영원한", "올바른", "유능한", "슬기로운", "야무진", "아련한", "보드라운", "명확한", "당찬", "강인한",
            "진귀한", "활기찬", "탐스러운", "은근한", "몽글한", "올곧은", "명쾌한", "기운찬", "반듯한", "유익한",
            "탁월한", "원활한", "정성된", "돈독한", "포실한", "매끄러운", "동그란", "푸근한", "희망찬", "그윽한",
            "미더운", "뽀용한", "둔탁한", "흐믓한", "감성적인", "털털한"
    };
    private final String[] nouns = {
            "다람쥐", "토끼", "강아지", "고양이", "펭귄", "쿼카", "여우", "사자", "호랑이", "치타",
            "수달", "해달", "곰", "판다", "코알라", "노루", "사슴", "고래", "돌고래", "거북이",
            "참새", "까치", "부엉이", "올빼미", "독수리", "하마", "기린", "코끼리", "물개", "두루미",
            "병아리", "너구리", "두더지", "비버", "알파카", "라마", "염소", "양", "송아지", "망아지",
            "망둥어", "거북", "문어", "상어", "범고래", "꿀벌", "매머드", "미어캣", "도마뱀", "앵무새",
            "개구리", "올챙이", "조개", "소라", "해파리", "물고기", "연어", "참치", "메기", "장어",
            "나비", "잠자리", "사마귀", "소", "말", "돼지", "생쥐", "고라니", "맷돼지", "순록",
            "낙타", "표범", "늑대", "코요테", "듀공", "매너티", "오리", "거위", "백조", "타조",
            "콘도르", "박쥐", "청서", "삵", "족제비", "들개", "딱새", "꿩", "닭", "기러기",
            "제비", "갈매기", "학", "매", "수리", "꾀꼬리", "비둘기", "고등어", "꽁치", "조기",
            "광어", "우럭", "농어", "도미", "잉어", "붕어", "송어", "가오리", "홍어", "자라",
            "도롱뇽", "맹꽁이", "뱀", "지네", "개미", "매미", "말벌", "나방", "거미", "전갈",
            "지렁이", "달팽이", "가재", "게", "굴", "새우", "고니", "무수", "쏙", "소금", "뿔닭",
            "치어", "고니", "물닭", "방울새", "솔개", "뜸부기", "할미새", "물거미", "베짱이", "여치",
            "진돗개", "허스키", "푸들", "따오기", "도요새", "물떼새", "가재", "말티즈", "치와와"
    };
    private final Random random = new Random();

    public String generateRandomNickname() {
        String adj = adjs[random.nextInt(adjs.length)];
        String noun = nouns[random.nextInt(nouns.length)];

        return adj + noun;
    }
}